RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_mipi_dsi_regs.h
/* Bitfield definition for register: VID_HBP_TIME */
/*
 * VID_HPB_TIME (RW)
 *
 * configures the Horizontal back porch period in lane byte clock cycles
 */
#define MIPI_DSI_VID_HBP_TIME_VID_HPB_TIME_MASK (0xFFFU)
#define MIPI_DSI_VID_HBP_TIME_VID_HPB_TIME_SHIFT (0U)
#define MIPI_DSI_VID_HBP_TIME_VID_HPB_TIME_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_HBP_TIME_VID_HPB_TIME_SHIFT) & MIPI_DSI_VID_HBP_TIME_VID_HPB_TIME_MASK)
#define MIPI_DSI_VID_HBP_TIME_VID_HPB_TIME_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_HBP_TIME_VID_HPB_TIME_MASK) >> MIPI_DSI_VID_HBP_TIME_VID_HPB_TIME_SHIFT)

/* Bitfield definition for register: VID_HLINE_TIME */
/*
 * VID_HLINE_TIME (RW)
 *
 * configures the size of the total line time in lane byte clock cycles
 */
#define MIPI_DSI_VID_HLINE_TIME_VID_HLINE_TIME_MASK (0x7FFFU)
#define MIPI_DSI_VID_HLINE_TIME_VID_HLINE_TIME_SHIFT (0U)
#define MIPI_DSI_VID_HLINE_TIME_VID_HLINE_TIME_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_HLINE_TIME_VID_HLINE_TIME_SHIFT) & MIPI_DSI_VID_HLINE_TIME_VID_HLINE_TIME_MASK)
#define MIPI_DSI_VID_HLINE_TIME_VID_HLINE_TIME_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_HLINE_TIME_VID_HLINE_TIME_MASK) >> MIPI_DSI_VID_HLINE_TIME_VID_HLINE_TIME_SHIFT)

/* Bitfield definition for register: VID_VSA_LINES */
/*
 * VSA_LINES (RW)
 *
 * configures the verical synchronism active period measured in number of horizontal lines
 */
#define MIPI_DSI_VID_VSA_LINES_VSA_LINES_MASK (0x3FFU)
#define MIPI_DSI_VID_VSA_LINES_VSA_LINES_SHIFT (0U)
#define MIPI_DSI_VID_VSA_LINES_VSA_LINES_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_VSA_LINES_VSA_LINES_SHIFT) & MIPI_DSI_VID_VSA_LINES_VSA_LINES_MASK)
#define MIPI_DSI_VID_VSA_LINES_VSA_LINES_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_VSA_LINES_VSA_LINES_MASK) >> MIPI_DSI_VID_VSA_LINES_VSA_LINES_SHIFT)

/* Bitfield definition for register: VID_VBP_LINES */
/*
 * VBP_LINES (RW)
 *
 * configures the vertical back porch period measured in number of horizontal lines
 */
#define MIPI_DSI_VID_VBP_LINES_VBP_LINES_MASK (0x3FFU)
#define MIPI_DSI_VID_VBP_LINES_VBP_LINES_SHIFT (0U)
#define MIPI_DSI_VID_VBP_LINES_VBP_LINES_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_VBP_LINES_VBP_LINES_SHIFT) & MIPI_DSI_VID_VBP_LINES_VBP_LINES_MASK)
#define MIPI_DSI_VID_VBP_LINES_VBP_LINES_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_VBP_LINES_VBP_LINES_MASK) >> MIPI_DSI_VID_VBP_LINES_VBP_LINES_SHIFT)

/* Bitfield definition for register: VID_VFP_LINES */
/*
 * VFP_LINIES (RW)
 *
 * configures the vertical front porch period measured in number of horizontal lines
 */
#define MIPI_DSI_VID_VFP_LINES_VFP_LINIES_MASK (0x3FFU)
#define MIPI_DSI_VID_VFP_LINES_VFP_LINIES_SHIFT (0U)
#define MIPI_DSI_VID_VFP_LINES_VFP_LINIES_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_VFP_LINES_VFP_LINIES_SHIFT) & MIPI_DSI_VID_VFP_LINES_VFP_LINIES_MASK)
#define MIPI_DSI_VID_VFP_LINES_VFP_LINIES_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_VFP_LINES_VFP_LINIES_MASK) >> MIPI_DSI_VID_VFP_LINES_VFP_LINIES_SHIFT)

/* Bitfield definition for register: VID_VACTIVE_LINES */
/*
 * V_ACTIVE_LINES (RW)
 *
 * configures the vertical active period measured in number of horizontal lines
 */
#define MIPI_DSI_VID_VACTIVE_LINES_V_ACTIVE_LINES_MASK (0x3FFFU)
#define MIPI_DSI_VID_VACTIVE_LINES_V_ACTIVE_LINES_SHIFT (0U)
#define MIPI_DSI_VID_VACTIVE_LINES_V_ACTIVE_LINES_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_VACTIVE_LINES_V_ACTIVE_LINES_SHIFT) & MIPI_DSI_VID_VACTIVE_LINES_V_ACTIVE_LINES_MASK)
#define MIPI_DSI_VID_VACTIVE_LINES_V_ACTIVE_LINES_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_VACTIVE_LINES_V_ACTIVE_LINES_MASK) >> MIPI_DSI_VID_VACTIVE_LINES_V_ACTIVE_LINES_SHIFT)

/* Bitfield definition for register: CMD_MODE_CFG */
/*
 * MAX_RD_PKT_SIZE (RW)
 *
 * This bit configures the maximum read packet size command transmission type:
 * 0x0 (HIGHSPEED): Transition type is High Speed
 * 0x1 (LOWPOWER): Transition type is Low Power
 */
#define MIPI_DSI_CMD_MODE_CFG_MAX_RD_PKT_SIZE_MASK (0x1000000UL)
#define MIPI_DSI_CMD_MODE_CFG_MAX_RD_PKT_SIZE_SHIFT (24U)
#define MIPI_DSI_CMD_MODE_CFG_MAX_RD_PKT_SIZE_SET(x) (((uint32_t)(x) << MIPI_DSI_CMD_MODE_CFG_MAX_RD_PKT_SIZE_SHIFT) & MIPI_DSI_CMD_MODE_CFG_MAX_RD_PKT_SIZE_MASK)
#define MIPI_DSI_CMD_MODE_CFG_MAX_RD_PKT_SIZE_GET(x) (((uint32_t)(x) & MIPI_DSI_CMD_MODE_CFG_MAX_RD_PKT_SIZE_MASK) >> MIPI_DSI_CMD_MODE_CFG_MAX_RD_PKT_SIZE_SHIFT)

/*
 * DCS_LW_TX (RW)
 *
 * This bit configures the DCS long write packet command transmission type:
 * 0x0 (HIGHSPEED): Transition type is High Speed
 * 0x1 (LOWPOWER): Transition type is Low Power
 */
#define MIPI_DSI_CMD_MODE_CFG_DCS_LW_TX_MASK (0x80000UL)
#define MIPI_DSI_CMD_MODE_CFG_DCS_LW_TX_SHIFT (19U)
#define MIPI_DSI_CMD_MODE_CFG_DCS_LW_TX_SET(x) (((uint32_t)(x) << MIPI_DSI_CMD_MODE_CFG_DCS_LW_TX_SHIFT) & MIPI_DSI_CMD_MODE_CFG_DCS_LW_TX_MASK)
#define MIPI_DSI_CMD_MODE_CFG_DCS_LW_TX_GET(x) (((uint32_t)(x) & MIPI_DSI_CMD_MODE_CFG_DCS_LW_TX_MASK) >> MIPI_DSI_CMD_MODE_CFG_DCS_LW_TX_SHIFT)

/*
 * DCS_SR_0P_TX (RW)
 *
 * This bit configures the DCS short read packet with zero parameter command transmission type:
 * 0x0 (HIGHSPEED): Transition type is High Speed
 * 0x1 (LOWPOWER): Transition type is Low Power
 */
#define MIPI_DSI_CMD_MODE_CFG_DCS_SR_0P_TX_MASK (0x40000UL)
#define MIPI_DSI_CMD_MODE_CFG_DCS_SR_0P_TX_SHIFT (18U)
#define MIPI_DSI_CMD_MODE_CFG_DCS_SR_0P_TX_SET(x) (((uint32_t)(x) << MIPI_DSI_CMD_MODE_CFG_DCS_SR_0P_TX_SHIFT) & MIPI_DSI_CMD_MODE_CFG_DCS_SR_0P_TX_MASK)
#define MIPI_DSI_CMD_MODE_CFG_DCS_SR_0P_TX_GET(x) (((uint32_t)(x) & MIPI_DSI_CMD_MODE_CFG_DCS_SR_0P_TX_MASK) >> MIPI_DSI_CMD_MODE_CFG_DCS_SR_0P_TX_SHIFT)

/*
 * DCS_SW_1P_TX (RW)
 *
 * This bit configures the DCS short write packet with one parameter command transmission type:
 * 0x0 (HIGHSPEED): Transition type is High Speed
 * 0x1 (LOWPOWER): Transition type is Low Power
 */
#define MIPI_DSI_CMD_MODE_CFG_DCS_SW_1P_TX_MASK (0x20000UL)
#define MIPI_DSI_CMD_MODE_CFG_DCS_SW_1P_TX_SHIFT (17U)
#define MIPI_DSI_CMD_MODE_CFG_DCS_SW_1P_TX_SET(x) (((uint32_t)(x) << MIPI_DSI_CMD_MODE_CFG_DCS_SW_1P_TX_SHIFT) & MIPI_DSI_CMD_MODE_CFG_DCS_SW_1P_TX_MASK)
#define MIPI_DSI_CMD_MODE_CFG_DCS_SW_1P_TX_GET(x) (((uint32_t)(x) & MIPI_DSI_CMD_MODE_CFG_DCS_SW_1P_TX_MASK) >> MIPI_DSI_CMD_MODE_CFG_DCS_SW_1P_TX_SHIFT)

