RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_mipi_dsi_regs.h
/*
 * PHY_TESTDIN (RW)
 *
 * reserve
 */
#define MIPI_DSI_PHY_TST_CTRL1_PHY_TESTDIN_MASK (0xFFU)
#define MIPI_DSI_PHY_TST_CTRL1_PHY_TESTDIN_SHIFT (0U)
#define MIPI_DSI_PHY_TST_CTRL1_PHY_TESTDIN_SET(x) (((uint32_t)(x) << MIPI_DSI_PHY_TST_CTRL1_PHY_TESTDIN_SHIFT) & MIPI_DSI_PHY_TST_CTRL1_PHY_TESTDIN_MASK)
#define MIPI_DSI_PHY_TST_CTRL1_PHY_TESTDIN_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_TST_CTRL1_PHY_TESTDIN_MASK) >> MIPI_DSI_PHY_TST_CTRL1_PHY_TESTDIN_SHIFT)

/* Bitfield definition for register: INT_ST0 */
/*
 * DPHY_ERRORS_4 (R)
 *
 * indicates LP1 contention error ErrContentionLP1 from lane0
 */
#define MIPI_DSI_INT_ST0_DPHY_ERRORS_4_MASK (0x100000UL)
#define MIPI_DSI_INT_ST0_DPHY_ERRORS_4_SHIFT (20U)
#define MIPI_DSI_INT_ST0_DPHY_ERRORS_4_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_DPHY_ERRORS_4_MASK) >> MIPI_DSI_INT_ST0_DPHY_ERRORS_4_SHIFT)

/*
 * DPHY_ERRORS_3 (R)
 *
 * indicates LP0 contention error ErrContentionLP0 from lane0
 */
#define MIPI_DSI_INT_ST0_DPHY_ERRORS_3_MASK (0x80000UL)
#define MIPI_DSI_INT_ST0_DPHY_ERRORS_3_SHIFT (19U)
#define MIPI_DSI_INT_ST0_DPHY_ERRORS_3_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_DPHY_ERRORS_3_MASK) >> MIPI_DSI_INT_ST0_DPHY_ERRORS_3_SHIFT)

/*
 * DPHY_ERRORS_2 (R)
 *
 * indicates control error ErrControl from lane0
 */
#define MIPI_DSI_INT_ST0_DPHY_ERRORS_2_MASK (0x40000UL)
#define MIPI_DSI_INT_ST0_DPHY_ERRORS_2_SHIFT (18U)
#define MIPI_DSI_INT_ST0_DPHY_ERRORS_2_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_DPHY_ERRORS_2_MASK) >> MIPI_DSI_INT_ST0_DPHY_ERRORS_2_SHIFT)

/*
 * DPHY_ERRORS_1 (R)
 *
 * indicates ErrSyncEsc low-power data transmission synchronization error from lane 0
 */
#define MIPI_DSI_INT_ST0_DPHY_ERRORS_1_MASK (0x20000UL)
#define MIPI_DSI_INT_ST0_DPHY_ERRORS_1_SHIFT (17U)
#define MIPI_DSI_INT_ST0_DPHY_ERRORS_1_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_DPHY_ERRORS_1_MASK) >> MIPI_DSI_INT_ST0_DPHY_ERRORS_1_SHIFT)

/*
 * DPHY_ERRORS_0 (R)
 *
 * indicates ErrEsc escape entry error from lane0
 */
#define MIPI_DSI_INT_ST0_DPHY_ERRORS_0_MASK (0x10000UL)
#define MIPI_DSI_INT_ST0_DPHY_ERRORS_0_SHIFT (16U)
#define MIPI_DSI_INT_ST0_DPHY_ERRORS_0_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_DPHY_ERRORS_0_MASK) >> MIPI_DSI_INT_ST0_DPHY_ERRORS_0_SHIFT)

/*
 * ACK_WITH_ERR_15 (R)
 *
 * retrives the DSI protocal violation from the acknowledge error report
 */
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_15_MASK (0x8000U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_15_SHIFT (15U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_15_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_ACK_WITH_ERR_15_MASK) >> MIPI_DSI_INT_ST0_ACK_WITH_ERR_15_SHIFT)

/*
 * ACK_WITH_ERR_14 (R)
 *
 * retrives the reserved from the acknowledge error report
 */
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_14_MASK (0x4000U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_14_SHIFT (14U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_14_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_ACK_WITH_ERR_14_MASK) >> MIPI_DSI_INT_ST0_ACK_WITH_ERR_14_SHIFT)

/*
 * ACK_WITH_ERR_13 (R)
 *
 * retrives the invalid transmission length from the acknowledge error report
 */
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_13_MASK (0x2000U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_13_SHIFT (13U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_13_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_ACK_WITH_ERR_13_MASK) >> MIPI_DSI_INT_ST0_ACK_WITH_ERR_13_SHIFT)

/*
 * ACK_WITH_ERR_12 (R)
 *
 * retrieves the dsi vc id invalid from the acknowledge error report
 */
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_12_MASK (0x1000U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_12_SHIFT (12U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_12_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_ACK_WITH_ERR_12_MASK) >> MIPI_DSI_INT_ST0_ACK_WITH_ERR_12_SHIFT)

/*
 * ACK_WITH_ERR_11 (R)
 *
 * retrives the not recongnized dsi data type from the acknowledge error report
 */
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_11_MASK (0x800U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_11_SHIFT (11U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_11_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_ACK_WITH_ERR_11_MASK) >> MIPI_DSI_INT_ST0_ACK_WITH_ERR_11_SHIFT)

/*
 * ACK_WITH_ERR_10 (R)
 *
 * retrives the checksum error from the acknowledge error report
 */
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_10_MASK (0x400U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_10_SHIFT (10U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_10_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_ACK_WITH_ERR_10_MASK) >> MIPI_DSI_INT_ST0_ACK_WITH_ERR_10_SHIFT)

/*
 * ACK_WITH_ERR_9 (R)
 *
 * retrives the ECC error multi-bit from the acknowledge error report
 */
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_9_MASK (0x200U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_9_SHIFT (9U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR_9_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_ACK_WITH_ERR_9_MASK) >> MIPI_DSI_INT_ST0_ACK_WITH_ERR_9_SHIFT)

/*
 * ACK_WITH_ERR8 (R)
 *
 * retrives the ecc error sigle-bit from the acknowledge error report
 */
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR8_MASK (0x100U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR8_SHIFT (8U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR8_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_ACK_WITH_ERR8_MASK) >> MIPI_DSI_INT_ST0_ACK_WITH_ERR8_SHIFT)

/*
 * ACK_WITH_ERR7 (R)
 *
 * retrieves the reserved from the acknowledge error report
 */
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR7_MASK (0x80U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR7_SHIFT (7U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR7_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_ACK_WITH_ERR7_MASK) >> MIPI_DSI_INT_ST0_ACK_WITH_ERR7_SHIFT)

/*
 * ACK_WITH_ERR6 (R)
 *
 * retrieves the false control error fro the acknowledge error report
 */
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR6_MASK (0x40U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR6_SHIFT (6U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR6_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_ACK_WITH_ERR6_MASK) >> MIPI_DSI_INT_ST0_ACK_WITH_ERR6_SHIFT)

/*
 * ACK_WITH_ERR5 (R)
 *
 * retrives the peripheral timeout error from the acknowledge error report
 */
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR5_MASK (0x20U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR5_SHIFT (5U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR5_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_ACK_WITH_ERR5_MASK) >> MIPI_DSI_INT_ST0_ACK_WITH_ERR5_SHIFT)

