RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_mipi_dsi_regs.h
/*
 * MASK_ACK_WITH_ERR_11 (RW)
 *
 * disable the not recongnized dsi data type from the acknowledge error report
 */
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_11_MASK (0x800U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_11_SHIFT (11U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_11_SET(x) (((uint32_t)(x) << MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_11_SHIFT) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_11_MASK)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_11_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_11_MASK) >> MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_11_SHIFT)

/*
 * MASK_ACK_WITH_ERR_10 (RW)
 *
 * disable the checksum error from the acknowledge error report
 */
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_10_MASK (0x400U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_10_SHIFT (10U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_10_SET(x) (((uint32_t)(x) << MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_10_SHIFT) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_10_MASK)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_10_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_10_MASK) >> MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_10_SHIFT)

/*
 * MASK_ACK_WITH_ERR_9 (RW)
 *
 * disable the ECC error multi-bit from the acknowledge error report
 */
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_9_MASK (0x200U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_9_SHIFT (9U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_9_SET(x) (((uint32_t)(x) << MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_9_SHIFT) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_9_MASK)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_9_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_9_MASK) >> MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR_9_SHIFT)

/*
 * MASK_ACK_WITH_ERR8 (RW)
 *
 * disable the ecc error sigle-bit from the acknowledge error report
 */
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR8_MASK (0x100U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR8_SHIFT (8U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR8_SET(x) (((uint32_t)(x) << MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR8_SHIFT) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR8_MASK)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR8_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR8_MASK) >> MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR8_SHIFT)

/*
 * MASK_ACK_WITH_ERR7 (RW)
 *
 * disable the reserved from the acknowledge error report
 */
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR7_MASK (0x80U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR7_SHIFT (7U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR7_SET(x) (((uint32_t)(x) << MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR7_SHIFT) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR7_MASK)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR7_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR7_MASK) >> MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR7_SHIFT)

/*
 * MASK_ACK_WITH_ERR6 (RW)
 *
 * disable the false control error fro the acknowledge error report
 */
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR6_MASK (0x40U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR6_SHIFT (6U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR6_SET(x) (((uint32_t)(x) << MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR6_SHIFT) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR6_MASK)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR6_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR6_MASK) >> MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR6_SHIFT)

/*
 * MASK_ACK_WITH_ERR5 (RW)
 *
 * disable the peripheral timeout error from the acknowledge error report
 */
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR5_MASK (0x20U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR5_SHIFT (5U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR5_SET(x) (((uint32_t)(x) << MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR5_SHIFT) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR5_MASK)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR5_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR5_MASK) >> MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR5_SHIFT)

/*
 * MASK_ACK_WITH_ERR4 (RW)
 *
 * disable the LP transmit sync error from the acknowledge error report
 */
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR4_MASK (0x10U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR4_SHIFT (4U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR4_SET(x) (((uint32_t)(x) << MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR4_SHIFT) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR4_MASK)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR4_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR4_MASK) >> MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR4_SHIFT)

/*
 * MASK_ACK_WITH_ERR3 (RW)
 *
 * disable the Escap mode entry command error from the acknowledge error report
 */
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR3_MASK (0x8U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR3_SHIFT (3U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR3_SET(x) (((uint32_t)(x) << MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR3_SHIFT) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR3_MASK)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR3_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR3_MASK) >> MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR3_SHIFT)

/*
 * MASK_ACK_WITH_ERR2 (RW)
 *
 * disable the EoT sync error from the acknowledge error report
 */
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR2_MASK (0x4U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR2_SHIFT (2U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR2_SET(x) (((uint32_t)(x) << MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR2_SHIFT) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR2_MASK)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR2_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR2_MASK) >> MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR2_SHIFT)

/*
 * MASK_ACK_WITH_ERR1 (RW)
 *
 * disable the SoT sync error from the acknowledge error report
 */
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR1_MASK (0x2U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR1_SHIFT (1U)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR1_SET(x) (((uint32_t)(x) << MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR1_SHIFT) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR1_MASK)
#define MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR1_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR1_MASK) >> MIPI_DSI_INT_MSK0_MASK_ACK_WITH_ERR1_SHIFT)

