RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_mipi_dsi_regs.h
/*
 * LP_VACT_EN (R)
 *
 * enable the returne to low-power inside the VACT period when timing allows
 */
#define MIPI_DSI_VID_MODE_CFG_ACT_LP_VACT_EN_MASK (0x20U)
#define MIPI_DSI_VID_MODE_CFG_ACT_LP_VACT_EN_SHIFT (5U)
#define MIPI_DSI_VID_MODE_CFG_ACT_LP_VACT_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_MODE_CFG_ACT_LP_VACT_EN_MASK) >> MIPI_DSI_VID_MODE_CFG_ACT_LP_VACT_EN_SHIFT)

/*
 * LP_VFP_EN (R)
 *
 * enable the returne to low-power inside the VFP period when timing allows
 */
#define MIPI_DSI_VID_MODE_CFG_ACT_LP_VFP_EN_MASK (0x10U)
#define MIPI_DSI_VID_MODE_CFG_ACT_LP_VFP_EN_SHIFT (4U)
#define MIPI_DSI_VID_MODE_CFG_ACT_LP_VFP_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_MODE_CFG_ACT_LP_VFP_EN_MASK) >> MIPI_DSI_VID_MODE_CFG_ACT_LP_VFP_EN_SHIFT)

/*
 * LP_VBP_EN (R)
 *
 * enable the returne to low-power inside the VBP period when timing allows
 */
#define MIPI_DSI_VID_MODE_CFG_ACT_LP_VBP_EN_MASK (0x8U)
#define MIPI_DSI_VID_MODE_CFG_ACT_LP_VBP_EN_SHIFT (3U)
#define MIPI_DSI_VID_MODE_CFG_ACT_LP_VBP_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_MODE_CFG_ACT_LP_VBP_EN_MASK) >> MIPI_DSI_VID_MODE_CFG_ACT_LP_VBP_EN_SHIFT)

/*
 * LP_VSA_EN (R)
 *
 * enable the returne to low-power inside the VSA period when timing allows
 */
#define MIPI_DSI_VID_MODE_CFG_ACT_LP_VSA_EN_MASK (0x4U)
#define MIPI_DSI_VID_MODE_CFG_ACT_LP_VSA_EN_SHIFT (2U)
#define MIPI_DSI_VID_MODE_CFG_ACT_LP_VSA_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_MODE_CFG_ACT_LP_VSA_EN_MASK) >> MIPI_DSI_VID_MODE_CFG_ACT_LP_VSA_EN_SHIFT)

/*
 * VID_MODE_TYPE (R)
 *
 * specifies the video mode transmission type
 */
#define MIPI_DSI_VID_MODE_CFG_ACT_VID_MODE_TYPE_MASK (0x3U)
#define MIPI_DSI_VID_MODE_CFG_ACT_VID_MODE_TYPE_SHIFT (0U)
#define MIPI_DSI_VID_MODE_CFG_ACT_VID_MODE_TYPE_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_MODE_CFG_ACT_VID_MODE_TYPE_MASK) >> MIPI_DSI_VID_MODE_CFG_ACT_VID_MODE_TYPE_SHIFT)

/* Bitfield definition for register: VID_PKT_SIZE_ACT */
/*
 * VID_PKT_SIZE (R)
 *
 * the number of pixels in a single video packet
 */
#define MIPI_DSI_VID_PKT_SIZE_ACT_VID_PKT_SIZE_MASK (0x3FFFU)
#define MIPI_DSI_VID_PKT_SIZE_ACT_VID_PKT_SIZE_SHIFT (0U)
#define MIPI_DSI_VID_PKT_SIZE_ACT_VID_PKT_SIZE_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_PKT_SIZE_ACT_VID_PKT_SIZE_MASK) >> MIPI_DSI_VID_PKT_SIZE_ACT_VID_PKT_SIZE_SHIFT)

/* Bitfield definition for register: VID_NUM_CHUNKS_ACT */
/*
 * VID_NUM_CHUNKS (R)
 *
 * the number of chunks to be transmitted during a line period
 */
#define MIPI_DSI_VID_NUM_CHUNKS_ACT_VID_NUM_CHUNKS_MASK (0x1FFFU)
#define MIPI_DSI_VID_NUM_CHUNKS_ACT_VID_NUM_CHUNKS_SHIFT (0U)
#define MIPI_DSI_VID_NUM_CHUNKS_ACT_VID_NUM_CHUNKS_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_NUM_CHUNKS_ACT_VID_NUM_CHUNKS_MASK) >> MIPI_DSI_VID_NUM_CHUNKS_ACT_VID_NUM_CHUNKS_SHIFT)

/* Bitfield definition for register: VID_NULL_SIZE_ACT */
/*
 * VID_NULL_SIZE (R)
 *
 * the number of bytes in side a null packet
 */
#define MIPI_DSI_VID_NULL_SIZE_ACT_VID_NULL_SIZE_MASK (0x1FFFU)
#define MIPI_DSI_VID_NULL_SIZE_ACT_VID_NULL_SIZE_SHIFT (0U)
#define MIPI_DSI_VID_NULL_SIZE_ACT_VID_NULL_SIZE_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_NULL_SIZE_ACT_VID_NULL_SIZE_MASK) >> MIPI_DSI_VID_NULL_SIZE_ACT_VID_NULL_SIZE_SHIFT)

/* Bitfield definition for register: VID_HSA_TIME_ACT */
/*
 * VID_HSA_TIME (R)
 *
 * the horizontal synchronism active period in lane byte clock cycles
 */
#define MIPI_DSI_VID_HSA_TIME_ACT_VID_HSA_TIME_MASK (0xFFFU)
#define MIPI_DSI_VID_HSA_TIME_ACT_VID_HSA_TIME_SHIFT (0U)
#define MIPI_DSI_VID_HSA_TIME_ACT_VID_HSA_TIME_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_HSA_TIME_ACT_VID_HSA_TIME_MASK) >> MIPI_DSI_VID_HSA_TIME_ACT_VID_HSA_TIME_SHIFT)

/* Bitfield definition for register: VID_HBP_TIME_ACT */
/*
 * VID_HBP_TIME (R)
 *
 * the horizontal back porch period in lane byte clock cycles
 */
#define MIPI_DSI_VID_HBP_TIME_ACT_VID_HBP_TIME_MASK (0xFFFU)
#define MIPI_DSI_VID_HBP_TIME_ACT_VID_HBP_TIME_SHIFT (0U)
#define MIPI_DSI_VID_HBP_TIME_ACT_VID_HBP_TIME_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_HBP_TIME_ACT_VID_HBP_TIME_MASK) >> MIPI_DSI_VID_HBP_TIME_ACT_VID_HBP_TIME_SHIFT)

/* Bitfield definition for register: VID_HLINE_TIME_ACT */
/*
 * VID_HLINE_TIME (R)
 *
 * the size of total line: hsa+hbp+hact+hfp
 */
#define MIPI_DSI_VID_HLINE_TIME_ACT_VID_HLINE_TIME_MASK (0x7FFFU)
#define MIPI_DSI_VID_HLINE_TIME_ACT_VID_HLINE_TIME_SHIFT (0U)
#define MIPI_DSI_VID_HLINE_TIME_ACT_VID_HLINE_TIME_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_HLINE_TIME_ACT_VID_HLINE_TIME_MASK) >> MIPI_DSI_VID_HLINE_TIME_ACT_VID_HLINE_TIME_SHIFT)

/* Bitfield definition for register: VID_VSA_LINES_ACT */
/*
 * VSA_LINES (R)
 *
 * vertical synchronism active period
 */
#define MIPI_DSI_VID_VSA_LINES_ACT_VSA_LINES_MASK (0x3FFU)
#define MIPI_DSI_VID_VSA_LINES_ACT_VSA_LINES_SHIFT (0U)
#define MIPI_DSI_VID_VSA_LINES_ACT_VSA_LINES_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_VSA_LINES_ACT_VSA_LINES_MASK) >> MIPI_DSI_VID_VSA_LINES_ACT_VSA_LINES_SHIFT)

/* Bitfield definition for register: VID_VBP_LINES_ACT */
/*
 * VBP_LINES (R)
 *
 * vertical back porch period
 */
#define MIPI_DSI_VID_VBP_LINES_ACT_VBP_LINES_MASK (0x3FFU)
#define MIPI_DSI_VID_VBP_LINES_ACT_VBP_LINES_SHIFT (0U)
#define MIPI_DSI_VID_VBP_LINES_ACT_VBP_LINES_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_VBP_LINES_ACT_VBP_LINES_MASK) >> MIPI_DSI_VID_VBP_LINES_ACT_VBP_LINES_SHIFT)

/* Bitfield definition for register: VID_VFP_LINES_ACT */
/*
 * VFP_LINES (R)
 *
 * vertical porch period
 */
#define MIPI_DSI_VID_VFP_LINES_ACT_VFP_LINES_MASK (0x3FFU)
#define MIPI_DSI_VID_VFP_LINES_ACT_VFP_LINES_SHIFT (0U)
#define MIPI_DSI_VID_VFP_LINES_ACT_VFP_LINES_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_VFP_LINES_ACT_VFP_LINES_MASK) >> MIPI_DSI_VID_VFP_LINES_ACT_VFP_LINES_SHIFT)

/* Bitfield definition for register: VID_VACTIVE_LINES_ACT */
/*
 * V_ACTIVE_LINES (R)
 *
 * vertical active period
 */
#define MIPI_DSI_VID_VACTIVE_LINES_ACT_V_ACTIVE_LINES_MASK (0x3FFFU)
#define MIPI_DSI_VID_VACTIVE_LINES_ACT_V_ACTIVE_LINES_SHIFT (0U)
#define MIPI_DSI_VID_VACTIVE_LINES_ACT_V_ACTIVE_LINES_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_VACTIVE_LINES_ACT_V_ACTIVE_LINES_MASK) >> MIPI_DSI_VID_VACTIVE_LINES_ACT_V_ACTIVE_LINES_SHIFT)

